In [1]:
# import Libraries
import pandas as pd
from sqlalchemy import create_engine

## Import Sales Data

In [2]:
# Create a dataframe 
df_sales = pd.read_csv('sales_data_sample.csv', encoding = 'latin1')
df_sales.head(5)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

## Data Understanding

In [3]:
len(df_sales['ORDERDATE'])

2823

### Extract product related data from Sales to populate stg_product

#### Product Data

In [4]:
df_product = df_sales[['PRODUCTCODE','PRODUCTLINE']]
df_product.head()

  PRODUCTCODE  PRODUCTLINE
0    S10_1678  Motorcycles
1    S10_1678  Motorcycles
2    S10_1678  Motorcycles
3    S10_1678  Motorcycles
4    S10_1678  Motorcycles

#### Create a connection to SQL Srever

In [2]:
server = 'DB_SERVER'
database = 'DB_NAME'
#username = ''
#password = '
conn_str = f'mssql+pyodbc://@{server}/{database}?trusted_connection=yes&driver=ODBC+Driver+17+for+SQL+Server'
engine = create_engine(conn_str)
engine

Engine(mssql+pyodbc://@DB_SERVER/DB_NAME?driver=ODBC+Driver+17+for+SQL+Server&trusted_connection=yes)

##### Upload the Data to SQL Table

In [6]:
# column mapping 
column_mapping=  {'PRODUCTCODE':'product_code',
                  'PRODUCTLINE': 'product_line'
                 }

In [7]:
df_product= df_product.rename(columns = column_mapping )
df_product

     product_code product_line
0        S10_1678  Motorcycles
1        S10_1678  Motorcycles
2        S10_1678  Motorcycles
3        S10_1678  Motorcycles
4        S10_1678  Motorcycles
...           ...          ...
2818     S72_3212        Ships
2819     S72_3212        Ships
2820     S72_3212        Ships
2821     S72_3212        Ships
2822     S72_3212        Ships

[2823 rows x 2 columns]

In [9]:
records_no = df_product.to_sql('stg_product', con = engine, if_exists = 'append', index= False)
print(records_no)

823